{
  "aow.tips": [
    "At the start of the season, beware of “*fishing*”; some players would lower the power rating of their defenses in order bait inexperienced players into attacking.",

    "When doing an Infinity War battle, using the “Heal” button is **not** recommended.",

    "Developer usually announces what would be on the next hero event on Thursday or Friday.",

    "When battling against Davison, avoid using mages and ballista.",

    "Whether you do 1× or 10× Super Card openings, each Super Card would give you an average of 27 <:aowmedal:847363788194054165>.",

    "At level 8000, you can earn a maximum of 6M <:aowcoin:847363788566560798> per day. The daily limit does not include additional earning from <:doublecoin:902093066083659797> or watching advertisements. To maximize your earning, watch advertisements whenever possible.",

    "Hohenheim and Jinn can increase <:aowcoin:847363788566560798> drops from defeated enemy units. Use Hohenheim or Jinn at main levels and headhunt missions whenever possible to increase your coin earning.",

    "You can turn off special effect (FX) from <:aowsettings:851720815049310208> to reduce battery consumption.",

    "After you purchase Weekly Card or Month Card, remember to check back in every day to claim the daily rewards.",

    "It is recommended to use <:aowmedal:847363788194054165> for upgrading troops to level 9 and 10 only.",

    "The best time to use Super Card Vouchers is during the Sunshine Event, which occurs twice a year (summer and winter).\n\nDuring the event, the first 1000 voucher openings yield 2× medals and increased chances for legendary heroes.",

    "Before you use Auto Battle in Headhunts, it is recommended that you do several battles in main levels and make sure <:doublecoin:902093066083659797> is unchecked on the victory screen.",

    "Remember to claim free troops in the Mystic Store and free rewards in the New Release (Shop page) every day.",

    "When adjusting your formation, do you feel nervous that you might __mistakenly merge troops__?\n\nHere is a trick. Go to your Arena defense and tap the “train” button. When you adjust your formation there, you cannot merge any troops!"
  ]
}
